# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLOv8-cls image classification model with YOLO backbone
# Model docs: https://docs.ultralytics.com/models/yolov8
# Task docs: https://docs.ultralytics.com/tasks/classify

# Parameters
nc: 101 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 1024]
  l: [1.00, 1.00, 1024]
  x: [1.00, 1.25, 1024]

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  #- [-1, 3, C2f, [128, True]]
  - [ -1, 2, StarBlock, [ 128 ] ] # 2 - StarBlocks at 128 channels

  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  #- [-1, 6, C2f, [256, True]]
  - [-1, 3, StarBlock, [256]] # 4 - StarBlocks at 256 channels

  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  #- [-1, 6, C2f, [512, True]]
  - [ -1, 3, StarBlock, [ 512 ] ] # 6 - StarBlocks at 512 channels

  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  #- [-1, 3, C2f, [1024, True]]
  - [ -1, 2, StarBlock, [ 1024 ] ] # 8 - StarBlocks at 1024 channels

  - [ -1, 1, SPPF, [ 1024, 5 ] ]
  - [ -1, 1, SpatialAttention, [ 7 ] ]
  #- [ -1, 1, ChannelAttention, [ 256] ]

# YOLOv8.0n head
head:
  - [ -1, 1, nn.Upsample, [ None, 2, "nearest" ] ]
  - [ [ -1, 6 ], 1, Concat, [ 1 ] ] # cat backbone P4
  - [ -1, 3, C2f, [ 512 ] ] # 12

  - [ -1, 1, nn.Upsample, [ None, 2, "nearest" ] ]
  - [ [ -1, 4 ], 1, Concat, [ 1 ] ] # cat backbone P3
  - [ -1, 3, C2f, [ 256 ] ] # 15 (P3/8-small)

  - [ -1, 1, Conv, [ 256, 3, 2 ] ]
  - [ [ -1, 12 ], 1, Concat, [ 1 ] ] # cat head P4
  - [ -1, 3, C2f, [ 512 ] ] # 18 (P4/16-medium)

  - [ -1, 1, Conv, [ 512, 3, 2 ] ]
  - [ [ -1, 9 ], 1, Concat, [ 1 ] ] # cat head P5
  - [ -1, 3, C2f, [ 1024 ] ] # 21 (P5/32-large)

  - [-1, 1, Classify, [nc]] # Classify



